import { v4 as uuidv4 } from "uuid";

export const COMMON_ROUTES_NAME: {
  id: string;
  name: string;
  to: string;
}[] = [
  { id: uuidv4(), name: "Головна", to: "/" },
  { id: uuidv4(), name: "Вартість", to: "/pricing" },
  { id: uuidv4(), name: "Про себе", to: "/about" },
  { id: uuidv4(), name: "Контакти", to: "/contacts" },
  { id: uuidv4(), name: "Блог", to: "/blog" },
];

export const COMMON_ROUTES_NAME_SUBMENU: {
  name: string;
  submenu: { id: string; name: string; to: string }[];
}[] = [
  {
    name: "Послуги",
    submenu: [
      { id: uuidv4(), name: "Консультації", to: "/services/consultations" },
      { id: uuidv4(), name: "Документація", to: "/services/documentation" },
      { id: uuidv4(), name: "Супровід", to: "/services/support" },
    ],
  },
];

export const CARD: {
  id: string;
  title: string;
  description: string[];
  icon: string;
}[] = [
  {
    id: uuidv4(),
    title: "Сімейне право",
    description: [
      "розірвання шлюбу",
      "стягнення аліментів",
      "поділ спільного майна подружжя",
      "позбавлення батьківських прав",
      "встановлення графіку побачень з дитиною, визначення місця проживання дитини",
    ],
    icon: "family-disputes",
  },
  {
    id: uuidv4(),
    title: "Спадкове право",
    description: [
      "встановлення фактів, що мають юридичне значення",
      "визнання права власності в порядку спадкування",
      "скасування заповіту, оскарження дій та рішень нотаріуса",
      "встановлення додаткового строку для прийняття спадщини",
      "супровід під час оформлення спадщини, вирішення інших питань, пов’язаних із спадщиною",
    ],
    icon: "home-land",
  },

  {
    id: uuidv4(),
    title: "Житлове право",
    description: [
      "справи щодо усунення перешкод в користуванні житловим приміщенням",
      "справи  про вселення або виселення особи; допомога у знятті особи із реєстрації",
      "спори з ОСББ",
      "стягнення шкоди, заподіяної затопленням квартири",
      "представництво інтересів клієнта при розірванні договору оренди приміщення",
    ],
    icon: "home",
  },
  {
    id: uuidv4(),
    title: "Земельне право",
    description: [
      "оскарження рішень, дій чи бездіяльності органів державної влади, органів місцевого самоврядування у випадку порушення прав особи;",
      "спори, пов’язані з орендою землі",
      "супровід при приватизації земельної ділянки та у виготовленні технічної документації на неї, присвоєння кадастрового номеру земельній ділянці",
      "спори щодо відшкодування збитків, заподіяних у процесі здійснення земельних прав",
    ],
    icon: "land",
  },
  {
    id: uuidv4(),
    title: "Господарське право",
    description: [
      "Допомога в написанні боргових розписок, розписок про передачу авансу, завдатку",
      "Спори, що виникають у випадку невиконання договорів, стягнення заборгованості",
      "Підготовка претензій в порядку досудового врегулювання спорів",
      "Надання усних та письмових консультацій із вивченням документів",
    ],
    icon: "contract",
  },
  {
    id: uuidv4(),
    title: "Справи про притягнення до адміністративної відповідальності",
    description: [
      "підготовка позову щодо скасування постанов про притягнення до адміністративної відповідальності",
      "представництво інтересів клієнта на стадії складання протоколу, або постанови про притягнення до адміністративної відповідальності",
      "участь в судових засіданнях у справах щодо притягнення до адміністративної відповідальності",
      "стягнення шкоди, заподіяної внаслідок вчинення адміністративного правопорушення",
    ],
    icon: "administration",
  },
  {
    id: uuidv4(),
    title: "Інші юридичні послуги",
    description: [
      "Супровід при оформленні договорів з нерухомості, консультування щодо вибору виду договору ",
      "Підготовка та подання документів для державної реєстрації створення, реорганізації, ліквідації юридичних осіб та фізичних осіб – підприємців; подання документів на внесення змін до державного реєстру",
      "Представництво інтересів клієнтів у судах, державних органах, установах, органах місцевого самоврядування, перед фізичним, юридичними особами тощо",
      "Надання юридичних консультацій онлайн, офлайн",
    ],
    icon: "other",
  },
];
